### This file is used to extract the number of crimes per city and produces a csv file called 'Number_Crimes_Per_City.csv'

In [1]:
import pandas as pd 
import numpy as np
import re

In [2]:
df = pd.read_excel('Table_8_Offenses_Known_to_Law_Enforcement_by_State_by_City_2019.xls')

In [3]:
df = df[['Unnamed: 1', 'Unnamed: 3']]
df

     Unnamed: 1      Unnamed: 3
0           NaN             NaN
1           NaN             NaN
2          City  Violent\ncrime
3        Hoover             114
4     Anchorage            3581
...         ...             ...
8111        NaN             NaN
8112        NaN             NaN
8113        NaN             NaN
8114        NaN             NaN
8115        NaN             NaN

[8116 rows x 2 columns]

In [4]:
df = df[~df['Unnamed: 1'].isnull()] #remove null values from the column'Unnamed:1'

In [5]:
df = df.iloc[1: , :]
df

               Unnamed: 1 Unnamed: 3
3                  Hoover        114
4               Anchorage       3581
5                  Bethel        130
6     Bristol Bay Borough          2
7                 Cordova          0
...                   ...        ...
8103             Sheridan          9
8104         Thermopolis5         13
8105           Torrington         13
8106            Wheatland          7
8107              Worland          8

[8105 rows x 2 columns]

In [6]:
df['Unnamed: 3'].isnull().values.any() ##remove null values from the column ['Unnamed: 3']

True

In [7]:
df = df[~df['Unnamed: 3'].isnull()]
df

               Unnamed: 1 Unnamed: 3
3                  Hoover        114
4               Anchorage       3581
5                  Bethel        130
6     Bristol Bay Borough          2
7                 Cordova          0
...                   ...        ...
8103             Sheridan          9
8104         Thermopolis5         13
8105           Torrington         13
8106            Wheatland          7
8107              Worland          8

[8084 rows x 2 columns]

In [8]:
df['Unnamed: 1'].isnull().values.any() #check if there is still null values

False

In [9]:
# #Here we use a regular expression to extract only the letters from each string 
df['Unnamed: 1'] = [re.sub(r'[^a-zA-Z]', '', i.strip()) for i in df['Unnamed: 1']]

/var/folders/83/66hrqspx1y920b9nscx5lpk00000gn/T/ipykernel_12587/206783097.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Unnamed: 1'] = [re.sub(r'[^a-zA-Z]', '', i.strip()) for i in df['Unnamed: 1']]

In [10]:
df['Unnamed: 1']

3                  Hoover
4               Anchorage
5                  Bethel
6       BristolBayBorough
7                 Cordova
              ...
8103             Sheridan
8104          Thermopolis
8105           Torrington
8106            Wheatland
8107              Worland
Name: Unnamed: 1, Length: 8084, dtype: object

In [11]:
#renaming each columns
df = df.rename(columns = {'Unnamed: 1': 'City', 'Unnamed: 3': 'Number_crimes'})

In [12]:
df

                   City Number_crimes
3                Hoover           114
4             Anchorage          3581
5                Bethel           130
6     BristolBayBorough             2
7               Cordova             0
...                 ...           ...
8103           Sheridan             9
8104        Thermopolis            13
8105         Torrington            13
8106          Wheatland             7
8107            Worland             8

[8084 rows x 2 columns]

In [13]:
train = pd.read_csv('train.csv', index_col='Uniq Id')

In [14]:
train.City

Uniq Id
d1051058987a9318579c5f4800b11ec9        Houston
d828481dab53c905602da163ae60719a       Columbus
337035af415268e839adee3721605b14       New York
75c39cde146e32ce3faee4d92966bf5a        Raleigh
a35163a58a636c23fe089e1e66f5c077    Bakersfield
                                       ...
025369af9dcc2b13e6f223bbe46eb1ea        Detroit
740cff8864ee9b042fd51892d6aa004c     Louisville
f1ba5ed512162c4371ed1c5c49d4971d        Lincoln
c0f00e2e37768394a9890917185adbca       Stockton
3c55c25010b7fdf623fd5059c4a55a10         Irving
Name: City, Length: 20000, dtype: object

In [15]:
df.loc[df['City'] == 'Stockton']

          City Number_crimes
676   Stockton          4380
1878  Stockton             2

In [16]:
#Here we decided to groupy by cities the number of crimes to get one value for each city
new_df = df.groupby(df.City).sum()

In [17]:
new_df

                  Number_crimes
City
Abbeville                   148
Aberdeen                    396
AberdeenTownship             15
Abernathy                     2
Abilene                     468
...                         ...
Zephyrhills                  49
Zilwaukee                     0
Zion                        130
Zionsville                    4
Zumbrota                      2

[6289 rows x 1 columns]

In [18]:
new_df.loc[new_df.index == 'Dallas'] # data check

        Number_crimes
City
Dallas          11832

In [37]:
new_df.to_csv('Number_Crimes_Per_City.csv') # write to csv file